InformationRegisters/ЖурналУчетаСотрудниковАутсорсинг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЖурналУчетаСотрудниковАутсорсинг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиВнештатныхСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоWeb</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаОтметки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиАутсорсинг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛистУчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛистУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтрагентыСотрудниковАутсорсинг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтрагентыСотрудниковАутсорсинг</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГруппаСотрудников</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСотрудниковАутсорсинг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЖурналУчетаСотрудниковАутсорсинг/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьКонтрагентСотрудника(мДатаОтметки, мСотрудник)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза"			, ?(ЗначениеЗаполнено(мДатаОтметки), мДатаОтметки, ТекущаяДата()));
	Запрос.УстановитьПараметр("ГруппаСотрудников"	, мСотрудник.ГруппаСотрудников);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтрагентыСотрудников.Контрагент
	|ИЗ
	|	РегистрСведений.КонтрагентыСотрудниковАутсорсинг.СрезПоследних(&ДатаСреза, ГруппаСотрудников = &ГруппаСотрудников) КАК КонтрагентыСотрудников";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Контрагент;
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДолжностьСотрудника(мСотрудник)
	
	Возврат мСотрудник.Должность;
	
КонецФункции


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекДатаЗапрета = Константы.ГраницаЗапретаРасчетаСотрудниковАутсорсинг.Получить();
	Если ЗначениеЗаполнено(ТекДатаЗапрета) Тогда
		Для каждого Запись Из ТекущийОбъект Цикл
			Если Запись.Период > ТекДатаЗапрета Тогда
				Продолжить;
			КонецЕсли;
			Сообщить("Период записи должен быть больше даты запрета редактирования данных по сотрудникам (аутсорсннг)! Запись невозможна.");
			Отказ = Истина;
			Возврат;
		КонецЦикла;
	КонецЕсли;  
	
	Если НЕ Запись.Контрагент = Запись.Сотрудник.Контрагент Тогда
		Запись.Контрагент = Запись.Сотрудник.Контрагент;
	КонецЕсли;
	Если НЕ Запись.Должность = Запись.Сотрудник.Должность Тогда
		Запись.Должность = Запись.Сотрудник.Должность;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	Запись.Контрагент 	= ПолучитьКонтрагентСотрудника(Запись.ДатаОтметки, Запись.Сотрудник);
	Запись.Должность 	= ПолучитьДолжностьСотрудника(Запись.Сотрудник);
	
КонецПроцедуры
